
public class Ex03 {

	public static void main(String[] args) {

//		int a= 10;
//		int b= 5;
//		
//		if ( a>20 && b>5 )
//	// 처리를 해야할 때 조건에 대해 전부 계산하려면, 연산시간이 많이 걸리므로, 
//	//앞의 조건이 불만족하는 경우 뒤의 조건은 처리하지 않는다.
//	//앞에 조건은 가능한 연산시간이 짧은 것을 배치해야 한다. 
//			
//		int a= 30;
//		int b= 5;
//		
//		if ( a>20 && b>5 )
//	// 처리를 해야할 때 조건에 대해 전부 계산하려면, 연산시간이 많이 걸리므로, 
//	//앞의 조건이 불만족하는 경우 뒤의 조건은 처리하지 않는다.
//	//앞에 조건은 가능한 연산시간이 짧은 것을 배치해야 한다.
//
//			System.out.println("만족");
//			System.out.println("불만족 ");	
//	}

	}}
